home/.config/emacs/config.org
#+TITLE: oxcl emacs config
#+AUTHOR: oxcl
#+DESCRIPTION: my personal emacs config
#+STARTUP: overview
#+PROPERTY: header-args :results silent :tangle ./init.el
* startup optimizations
most of theses optimizations are taken from doom emacs [[https://github.com/doomemacs/doomemacs/blob/master/lisp/doom.el][doom.el]]
#+begin_src elisp
  (unless init-file-debug
    (setq frame-inhibit-implied-size t
	  inhibit-startup-screen t
	  inhibit-startup-echo-area-message user-login-name
	  initial-major-mode 'fundamental-mode
	  initial-scratch-message nil
	  inhibit-redisplay t
	  inhibit-message t
	  read-process-output-max (* 1024 1024 3))
    (defun oxcl/reset-inhibited-vars-h ()
      (setq-default inhibit-redisplay nil
		    inhibit-message nil)
      (redraw-frame))
    (add-hook 'after-init-hook #'oxcl/reset-inhibited-vars-h)
    (define-advice startup--load-user-init-file (:after (&rest _) undo-inhibit-vars)
      (when init-file-had-error
	(doom--reset-inhibited-vars-h)))
    (advice-add #'display-startup-echo_area-message :override #'ignore)
    (advice-add #'display-startup-screen :override #'ignore)
    (define-advice load-file (:override (file) silence)
      (load file nil 'nomessage))
    (define-advice startup--load-user-init-file (:before (&rest _) undo-silence)
      (advice-remove #'load-file #'load-file@silence))

    (advice-add #'tool-bar-setup :override #'ignore)
    (define-advice startup--load-user-init-file (:before (&rest _) defer-tool-bar-setup)
      (advice-remove #'tool-bar-setup #'ignore)
      (add-transient-hook! 'tool-bar-mode (tool-bar-setup))))
#+end_src

* sane defaults
** unclutter working directory
*** relocate emacs user directory
because many packages including builtin ones use ~user-emacs-directory
#+begin_src elisp
  (setq real-user-emacs-directory user-emacs-directory)
  (setq user-emacs-directory oxcl/cache-dir)
  (setq server-auth-dir (expand-file-name "server" real-user-emacs-directory))
#+end_src

*** relocate backup files directory
#+begin_src emacs-lisp
  (setq backup-directory-alist `((".*" . ,(expand-file-name "emacs/backups" oxcl/cache-dir))))
#+end_src

*** relocate auto-save files directory
#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms `((".*" ,(expand-file-name "save" oxcl/cache-dir) t)))
#+end_src

*** disable lockfiles
#+begin_src elisp
  (setq create-lockfiles nil)
#+end_src

** reduce verbosity
#+begin_src elisp
  ;; suppress compiler warnings
  (setq native-comp-async-report-warnings-errors init-file-debug
	native-comp-warning-on-missing-source init-file-debug
	ad-redefinition-action 'accept)
#+end_src

** enforce TLS
make sure internet communications are in TLS.this code is taken from [[https://github.com/doomemacs/doomemacs/blob/master/lisp/doom.el#L646][doomemacs]]
#+begin_src elisp
  (setq gnutls-verify-error noninteractive
	gnutls-algorithm-priority
	(when (boundp 'libgnutls-version)
	  (concat "SECURE128:+SECURE192:-VERS-ALL"
		  (if (and (not (memq system-type '(cygwin windows-nt ms-dos)))
			   (>= libgnutls-version 30605))
		      ":+VERS-TLS1.3")
		  ":+VERS-TLS1.2"))
	;; `gnutls-min-prime-bits' is set based on recommendations from
	;; https://www.keylength.com/en/4/
	gnutls-min-prime-bits 3072
	tls-checktrust gnutls-verify-error
	;; Emacs is built with gnutls.el by default, so `tls-program' won't
	;; typically be used, but in the odd case that it does, we ensure a more
	;; secure default for it (falling back to `openssl' if absolutely
	;; necessary). See https://redd.it/8sykl1 for details.
	tls-program '("openssl s_client -connect %h:%p -CAfile %t -nbio -no_ssl3 -no_tls1 -no_tls1_1 -ign_eof"
		      "gnutls-cli -p %p --dh-bits=3072 --ocsp --x509cafile=%t \
  --strict-tofu --priority='SECURE192:+SECURE128:-VERS-ALL:+VERS-TLS1.2:+VERS-TLS1.3' %h"
		      ;; compatibility fallbacks
		      "gnutls-cli -p %p %h"))

#+end_src

* package manager
** add local scripts to path
#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "lisp" real-user-emacs-directory))
#+end_src

** elpaca
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.6)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src
** use-package
#+begin_src emacs-lisp
  (elpaca elpaca-use-package
    (elpaca-use-package-mode)
    (setq use-package-always-ensure t))
  (elpaca-wait)
#+end_src

* ui
** sane defaults
#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore ; disable visual or audible ring
	overflow-newline-into-fringe nil)  ; stop cursor & chars from going in fringe zone
  (scroll-bar-mode -1)
  (tool-bar-mode -1) ; hide the tool bar (with the icons)
  (menu-bar-mode -1) ; hide the menu bar
  (tooltip-mode -1) ; hide tooltip popup window on mouse hover
  (blink-cursor-mode -1) ; disable cursor blink
  (set-fringe-mode '(0 . 10)) ; add small margin to the right of the editor
#+end_src

** font
#+begin_src emacs-lisp
  (set-frame-font "JetBrainsMono 11")
;;	 (set-frame-font (format "JetBrains Mono %d" (round (/ 11000 (+( x-display-pixel-width) 120)))) nil t)
      ;;  (set-face-attribute 'default (selected-frame) :height (round (/ 100000 (* (x-display-pixel-width)  1.1)))) :family "JetBrainsMono Nerd Font")
;;    (set-face-attribute 'default (selected-frame) :family "JetBrainsMono Nerd Font" :height (/ 102400 (* (x-display-pixel-width) 1)))
    (setq-default line-spacing 1) ; small padding between each line
#+end_src

** theme
#+begin_src emacs-lisp
    (use-package doom-themes
      :config
      (setq doom-themes-enable-bold t
  	  doom-themes-enable-italic t
  	  custom-theme-directory (expand-file-name "themes/" real-user-emacs-directory)
  	  doom-my-theme-brighter-modeline t
  	  doom-my-theme-padded-modeline 4)
      (doom-themes-org-config)
      (if (equal (getenv "MY_THEME_LOADED") "1")
  	(load-theme 'doom-my t)
        (load-theme 'doom-gruvbox t)))
    (use-package solaire-mode
      :after doom-themes
      :config
      (solaire-global-mode +1))
#+end_src

** line numbers column
#+begin_src emacs-lisp
  (setq-default display-line-numbers-width 4) ; how many digits for line numbers
  (dolist (mode '(prog-mode-hook text-mode-hook restclient-mode-hook conf-mode-hook))
    (add-hook mode 'display-line-numbers-mode))
  (setq require-final-newline t)
#+end_src

** highlight current line
#+begin_src emacs-lisp
  (global-hl-line-mode)
  (dolist (mode '(comint-mode-hook restclient-mode-hook org-mode-hook vterm-mode-hook))
    (add-hook mode (lambda () (setq-local global-hl-line-mode nil)))) ; org-mode has a lot of bugs with hl-line
#+end_src

** icons
all-the-icons fonts should be installed for this to work
#+begin_src elisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src

* editor
