home/.config/emacs/config.org
** text navigation
left arrow should keep the cursor at the end of the line instead of jumping to the next line
#+begin_src elisp
  (setq track_eol t)
#+end_src

** window management
*** scrolling
**** defaults
#+begin_src elisp
  (setq scroll-error-top-bottom t ; put the cursor at the top or bottom of the window if no more scrolls are possible
	scroll-conservatively 100 ; only scroll the minimum lines at a time when the cursor goes out the window
	scroll-margin 5) ; start scrolling the window when the distance between the cursor and the window boundaries are less than this number

#+end_src

**** scroll windows by half a page
scroll by half a page instead of a full bage whith PageDown/PageUp keys
also works with M-PageDown/M-PageUp (scroll-other-window/scroll-other-window-down)
#+begin_src elisp
  ;; make ScrollDown and ScrollUp Commands Scroll half a screen
  (defun oxcl/scroll-up-half ()
    (interactive)
    (scroll-up-command
     (floor
      (- (window-height)
	 next-screen-context-lines)
      2)))
  (defun oxcl/scroll-down-half ()
    (interactive)
    (scroll-down-command
     (floor
      (- (window-height)
	 next-screen-context-lines)
      2)))
  (defun oxcl/scroll-other-down-half()
    (interactive)
    (scroll-other-window-down
     (floor
      (- (window-height)
	 next-screen-context-lines)
      2)))
  (defun oxcl/scroll-other-up-half()
    (interactive)
    (scroll-other-window
     (floor
      (- (window-height)
	 next-screen-context-lines)
      2)))
  (global-set-key (kbd "<next>") 'oxcl/scroll-up-half)
  (global-set-key (kbd "<prior>") 'oxcl/scroll-down-half)
  (global-set-key (kbd "M-<next>") 'oxcl/scroll-other-up-half)
  (global-set-key (kbd "M-<prior>") 'oxcl/scroll-other-down-half)
#+end_src

*** navigation
**** ace
#+begin_src elisp
  (use-package ace-window
    :bind ("M-o" . 'ace-window)
    :config
    (setq aw-keys '(?a ?r ?s ?d ?g ?p ?d ?b ?v)))
#+end_src

** highlight current symbol
highlight the word/symbol under the cursor (with a small delay) and all its occurrences in the visible buffer
#+begin_src elisp
  (use-package idle-highlight-mode
    :hook ((prog-mode text-mode) . idle-highlight-mode)
    :custom
    (idle-highlight-idle-time 0.1)
    (idle-highlight-exceptions-face '(font-lock-comment-face)))
#+end_src

** jump to occurrence of symbol under the cursor
C-* jumps to the next occurrence the symbol that is under the cursor.
#+begin_src elisp
  ;; this function adds wrap functionality to smartscan.
  (defun oxcl/smartscan-wrap ()
    (interactive)
    (let ((symbol (smartscan-symbol-at-pt 'end))
	  (pos (point)))
      (when (smartscan-symbol-go-forward)
	(beginning-of-buffer)
	(smartscan-symbol-goto symbol 'forward)
	(unless (bobp) (setq pos (point)))
	(goto-char pos))))
  (use-package smartscan
    :config
    (global-smartscan-mode)
    (keymap-global-set "C-*" 'oxcl/smartscan-wrap))
#+end_src

** undo
*** linear undo
make undo behave more linearly like other applications.
keybindings are:
C-_   : normal undo
S-C-_ : normal redo
C-x u : emacs  undo
C-x U : emacs  redo
#+begin_src elisp
  (keymap-global-unset "C-/")
  (keymap-global-unset "C-?")
  (keymap-global-set "C-_" #'undo-only)
  (keymap-global-set "C--" #'undo-redo)
#+end_src

*** undo tree and branching

** persistent cursor position across sessions
#+begin_src elisp
  (save-place-mode 1)
  (setq save-place-forget-unreadable-files nil)
#+end_src

* spell checking
the builtin flyspell package will check each word under the cursor spelling against the specified backend.
#+begin_src elisp
  ;; ignore case sensitive spell checks
  (defun oxcl/jinx-lower-case-word-valid-p (start)
    "Return non-nil if word, that is assumed to be in lower case, at
     START is valid, or would be valid if capitalized or upcased."
    (let ((word (buffer-substring-no-properties start (point))))
      (or (member word jinx--session-words)
	  (cl-loop for dict in jinx--dicts thereis
		   (or
		    (jinx--mod-check dict (upcase word))
		    (jinx--mod-check dict (capitalize word))
		    (jinx--mod-check dict word))))))
  (defun oxcl/jinx-add-to-personal ()
    (interactive)
    (let ((word (current-word t t)))
      (jinx--save-personal t nil word)
      (jinx-mode -1)
      (jinx-mode 1)))
  (use-package jinx
    :hook ((text-mode prog-mode conf-mode org-mode) . jinx-mode)
    :custom
    (jinx-languages "en_US fa_IR")
    (jinx-camel-modes '(prog-mode conf-mode org-mode))
    (jinx-exclude-faces '((org-mode org-block-begin-line org-block-end-line)
			  (t font-lock-keyword-face font-lock-builtin-face)))
    :config
    (add-to-list 'jinx-exclude-regexps '(t "\\b[a-zA-Z]\\{2\\}\\b"))
    (set 'jinx--predicates
	 (cl-substitute
	  #'oxcl/jinx-lower-case-word-valid-p
	  #'jinx--word-valid-p
	  jinx--predicates))
    :bind
    ("C-$" . jinx-correct)
    ("C-@" . oxcl/jinx-add-to-personal))
#+end_src

* minibuffer
** history
*** persistent history across sessions
#+begin_src emacs-lisp
  (savehist-mode 1)
  (add-to-list 'savehist-additional-variables '(search-ring-regexp-search-ring file-name-history))
#+end_src

*** keybindings
#+begin_src elisp
  (defun oxcl/set-minibuffer-keybindings ()
    "Add custom keybindings for the  minibuffer."
    (local-set-key (kbd "M-<up>")   #'previous-history-element)
    (local-set-key (kbd "M-<down>") #'next-history-element))
  (add-hook 'minibuffer-setup-hook 'oxcl/set-minibuffer-keybindings)
#+end_src

** search and replace
*** make isearch better
**** sane defaults
#+begin_src emacs-lisp
  (setq-default case-fold-search nil ; make search case sensitive by default
		char-fold-symmetric t  ; accent character's match the regular character as well
		search-ring-max 64
		regexp-search-ring-max 64)
  ;; TODO: make sure char-fold-table includes farsi letters
#+end_src

**** frictionless search
#+begin_src emacs-lisp

  ;; while using incremental search when going from C-s to C-r or from C-r to C-s go to the
  ;; next/previous match immediately. instead of requiring two key presses
  (setq isearch-repeat-on-direction-change t)

  ;; make the backspace delete the search query immediately!
  ;; for going back to the previous match use C-r
  (define-key isearch-mode-map [remap isearch-delete-char] 'isearch-del-char)
  ;; clear the search string with C-S-<backspace> like other minibuffer prompts
  (defun oxcl/isearch-clear ()
    (interactive))
  (define-key isearch-mode-map (kbd "C-S-<backspace>") #'oxcl/isearch-clear)
  ;; automatically wrap around the buffer when no result is found
  (setq isearch-wrap-pause 'no)

  ;; exit out of search with a single C-g in all scenarios
  (defun oxcl/isearch-full-abort ()
    (interactive)
    (isearch-abort)
    (when isearch-mode (isearch-abort)))
  (define-key isearch-mode-map [remap isearch-abort] #'oxcl/isearch-full-abort)
#+end_src

**** isearch history
#+begin_src emacs-lisp
  (define-key isearch-mode-map (kbd "<M-up>") 'isearch-ring-retreat)
  (define-key isearch-mode-map (kbd "<M-down>") 'isearch-ring-advance)
#+end_src

;; when using C-s C-w to search for the word under the cursor grab the entire word
;; even if the cursor is in the middle of the word
(defun oxcl/isearch-yank-word-at-point ()
"Yank the whole word at point into the isearch buffer."
(interactive)
(save-excursion
(if (and (not isearch-forward)
isearch-other-end)
(goto-char isearch-other-end))
(skip-syntax-backward "w_")
(isearch-yank-string (buffer-substring-no-properties (point)
(progn (skip-syntax-forward "w_")
(point))))))

(define-key isearch-mode-map (kbd "C-w") 'oxcl/isearch-yank-word-at-point)

#+end_src

**** disable momentary messages
disable isearch annoying messages which appear after the search string and sometimes cause a delay
#+begin_src elisp
  (defun oxcl/isearch--momentary-message (orig-fun &rest args)
    (apply orig-fun `(,(car args) 0)))
  (advice-add 'isearch--momentary-message :around #'oxcl/isearch--momentary-message)
#+end_src

