home/.config/emacs/init.el

(setq scroll-error-top-bottom t ; put the cursor at the top or bottom of the window if no more scrolls are possible
      scroll-conservatively 100 ; only scroll the minimum lines at a time when the cursor goes out the window
      scroll-margin 5) ; start scrolling the window when the distance between the cursor and the window boundaries are less than this number

;; make ScrollDown and ScrollUp Commands Scroll half a screen
(defun oxcl/scroll-up-half ()
  (interactive)
  (scroll-up-command
   (floor
    (- (window-height)
       next-screen-context-lines)
    2)))
(defun oxcl/scroll-down-half ()
  (interactive)
  (scroll-down-command
   (floor
    (- (window-height)
       next-screen-context-lines)
    2)))
(defun oxcl/scroll-other-down-half()
  (interactive)
  (scroll-other-window-down
   (floor
    (- (window-height)
       next-screen-context-lines)
    2)))
(defun oxcl/scroll-other-up-half()
  (interactive)
  (scroll-other-window
   (floor
    (- (window-height)
       next-screen-context-lines)
    2)))
(global-set-key (kbd "<next>") 'oxcl/scroll-up-half)
(global-set-key (kbd "<prior>") 'oxcl/scroll-down-half)
(global-set-key (kbd "M-<next>") 'oxcl/scroll-other-up-half)
(global-set-key (kbd "M-<prior>") 'oxcl/scroll-other-down-half)

(use-package ace-window
  :bind ("M-o" . 'ace-window)
  :config
  (setq aw-keys '(?a ?r ?s ?d ?g ?p ?d ?b ?v)))

(use-package idle-highlight-mode
  :hook ((prog-mode text-mode) . idle-highlight-mode)
  :custom
  (idle-highlight-idle-time 0.1)
  (idle-highlight-exceptions-face '(font-lock-comment-face)))

;; this function adds wrap functionality to smartscan.
(defun oxcl/smartscan-wrap ()
  (interactive)
  (let ((symbol (smartscan-symbol-at-pt 'end))
	(pos (point)))
    (when (smartscan-symbol-go-forward)
      (beginning-of-buffer)
      (smartscan-symbol-goto symbol 'forward)
      (unless (bobp) (setq pos (point)))
      (goto-char pos))))
(use-package smartscan
  :config
  (global-smartscan-mode)
  (keymap-global-set "C-*" 'oxcl/smartscan-wrap))

(keymap-global-unset "C-/")
(keymap-global-unset "C-?")
(keymap-global-set "C-_" #'undo-only)
(keymap-global-set "C--" #'undo-redo)

(save-place-mode 1)
(setq save-place-forget-unreadable-files nil)

;; ignore case sensitive spell checks
(defun oxcl/jinx-lower-case-word-valid-p (start)
  "Return non-nil if word, that is assumed to be in lower case, at
   START is valid, or would be valid if capitalized or upcased."
  (let ((word (buffer-substring-no-properties start (point))))
    (or (member word jinx--session-words)
	(cl-loop for dict in jinx--dicts thereis
		 (or
		  (jinx--mod-check dict (upcase word))
		  (jinx--mod-check dict (capitalize word))
		  (jinx--mod-check dict word))))))
(defun oxcl/jinx-add-to-personal ()
  (interactive)
  (let ((word (current-word t t)))
    (jinx--save-personal t nil word)
    (jinx-mode -1)
    (jinx-mode 1)))
(use-package jinx
  :hook ((text-mode prog-mode conf-mode org-mode) . jinx-mode)
  :custom
  (jinx-languages "en_US fa_IR")
  (jinx-camel-modes '(prog-mode conf-mode org-mode))
  (jinx-exclude-faces '((org-mode org-block-begin-line org-block-end-line)
			(t font-lock-keyword-face font-lock-builtin-face)))
  :config
  (add-to-list 'jinx-exclude-regexps '(t "\\b[a-zA-Z]\\{2\\}\\b"))
  (set 'jinx--predicates
       (cl-substitute
	#'oxcl/jinx-lower-case-word-valid-p
	#'jinx--word-valid-p
	jinx--predicates))
  :bind
  ("C-$" . jinx-correct)
  ("C-@" . oxcl/jinx-add-to-personal))

(savehist-mode 1)
(add-to-list 'savehist-additional-variables '(search-ring-regexp-search-ring file-name-history))

(defun oxcl/set-minibuffer-keybindings ()
  "Add custom keybindings for the  minibuffer."
  (local-set-key (kbd "M-<up>")   #'previous-history-element)
  (local-set-key (kbd "M-<down>") #'next-history-element))
(add-hook 'minibuffer-setup-hook 'oxcl/set-minibuffer-keybindings)

(setq-default case-fold-search nil ; make search case sensitive by default
	      char-fold-symmetric t  ; accent character's match the regular character as well
	      search-ring-max 64
	      regexp-search-ring-max 64)
;; TODO: make sure char-fold-table includes farsi letters

;; while using incremental search when going from C-s to C-r or from C-r to C-s go to the
;; next/previous match immediately. instead of requiring two key presses
(setq isearch-repeat-on-direction-change t)

;; make the backspace delete the search query immediately!
;; for going back to the previous match use C-r
(define-key isearch-mode-map [remap isearch-delete-char] 'isearch-del-char)
;; clear the search string with C-S-<backspace> like other minibuffer prompts
(defun oxcl/isearch-clear ()
  (interactive))
(define-key isearch-mode-map (kbd "C-S-<backspace>") #'oxcl/isearch-clear)
;; automatically wrap around the buffer when no result is found
(setq isearch-wrap-pause 'no)

;; exit out of search with a single C-g in all scenarios
(defun oxcl/isearch-full-abort ()
  (interactive)
  (isearch-abort)
  (when isearch-mode (isearch-abort)))
(define-key isearch-mode-map [remap isearch-abort] #'oxcl/isearch-full-abort)

(define-key isearch-mode-map (kbd "<M-up>") 'isearch-ring-retreat)
(define-key isearch-mode-map (kbd "<M-down>") 'isearch-ring-advance)

(defun oxcl/isearch--momentary-message (orig-fun &rest args)
  (apply orig-fun `(,(car args) 0)))
(advice-add 'isearch--momentary-message :around #'oxcl/isearch--momentary-message)
