home/.config/emacs/config.org
**** loose search
add two new keybindings for C-S-s and C-S-r which does a case insensetive incremental search with lax space enabled. and taking '-' and '_' as the same
so it's practically a less strict loose version of the normal isearch. it should also work in a isearch buffer as well to convert the current search to a loose one
#+begin_src elisp
  (defun oxcl/loose-search (&optional arg)
    (interactive)
    (if (bound-and-true-p oxcl/loose-search)
	(if (bound-and-true-p arg)
	    (isearch-repeat-backward)
	  (isearch-repeat-forward))
      (setq oxcl/loose-search t)
      (or (featurep 'char-fold) (require 'char-fold))
      (oxcl/enable-loose-color)
      (let ((case-fold-search t) ; case insensitive
	    (default-search-mode 'char-fold-to-regexp)
	    (search-upper-case nil)
	    (search-whitespace-regexp "[ .\t\n\\(\\)\\.,_-]+")) ; stops uppercase letters to change case sensitivity behavior
	(set-char-table-range char-fold-table ?_ "-")
	(set-char-table-range char-fold-table ?- "_")
	(if (bound-and-true-p arg) (isearch-backward) (isearch-forward))
	(set-char-table-range char-fold-table ?_ nil)
	(set-char-table-range char-fold-table ?- nil)
	(oxcl/disable-loose-color)
	(setq oxcl/loose-search nil))))
  (defun oxcl/loose-backward-search ()
    (interactive)
    (oxcl/loose-search t))
  (keymap-global-set "C-S-s" #'oxcl/loose-search)
  (keymap-global-set "C-S-r" #'oxcl/loose-backward-search)
  (defun oxcl/make-loose (&optional arg)
    (interactive)
    (unless (featurep 'char-fold) (require 'char-fold))
    (if (bound-and-true-p oxcl/loose-search)
	(if (bound-and-true-p arg)
	    (isearch-repeat-backward)
	  (isearch-repeat-forward))
      (setq oxcl/loose-search t)
      (isearch-toggle-case-fold)
      (isearch-toggle-char-fold)
      (oxcl/enable-loose-color))
    (add-hook 'isearch-mode-end-hook #'oxcl/disable-loose-color))
  (defun oxcl/make-loose-backward ()
    (interactive)
    (oxcl/make-loose t))
  (define-key isearch-mode-map (kbd "C-S-s") #'oxcl/make-loose)
  (define-key isearch-mode-map (kbd "C-S-r") #'oxcl/make-loose-backward)
#+end_src
**** search count (lazy highlight)
show total number of matches in the minibuffer
#+begin_src emacs-lisp
  (setq isearch-lazy-count t
	lazy-highlight-initial-delay 0)
#+end_src

**** more modern regex
replace emacs regex with a more modern functional regex
#+begin_src elisp
#+end_src
* which key
#+begin_src elisp
  (use-package which-key
    :config
    (which-key-mode)
    (setq which-key-idle-delay 6.0
	  which-key-idle-secondary-delay 0.05
	  which-key-show-early-on-C-h t))
#+end_src

* org mode
#+begin_src elisp
;;  (setq org-confirm-babel-evaluate nil)
;;  (define-key org-mode-map (kbd "C-.") 'org-edit-src-code)
;;  (define-key org-src-mode-map (kbd "C-.") 'org-edit-src-exit)
#+end_src

* programming
** tree-sitter
*** enable tree-sitter
replace builtin tree-sitter major modes with the old ones
#+begin_src elisp
  (setq major-mode-remap-alist '((ruby-mode . ruby-ts-mode)
				 (c++-mode . c++-ts-mode)
				 (c-or-c++-mode . c-or-c++-ts-mode)
				 (c-mode . c-ts-mode)
				 (java-mode . java-ts-mode)
				 (js-mode . js-ts-mode)
				 (csharp-mode . csharp-ts-mode)
				 (js-json-mode . json-ts-mode)
				 (css-mode . css-ts-mode)
				 (python-mode . python-ts-mode)
				 (conf-toml-mode . toml-ts-mode)
				 (sh-mode . bash-ts-mode)))
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
  (add-to-list 'auto-mode-alist '("go\\.mod\\'" . go-mod-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.go\\'" . go-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))
  (add-to-list 'auto-mode-alist '("\\(\\.cmake\\|CMakeLists\\.txt\\)\\'" . cmake-ts-mode))
  (setq treesit-font-lock-level 4)
#+end_src

*** third-party ts-modes
since the builtin support for tree-sitter major modes is limited to few languages right now third-party packages are used as temporarily solution
**** clojure
#+begin_src elisp
  (use-package clojure-ts-mode
    :commands (clojure-ts-mode)
    :mode "\\.\\(clj\\|cljs\\|cljc\\)\\'")
#+end_src

**** kotlin
#+begin_src elisp
  (use-package kotlin-ts-mode
    :commands (kotlin-ts-mode)
    :mode "\\.kt\\'")
#+end_src

**** nix
#+begin_src elisp
  (use-package nix-ts-mode
    :commands (nix-ts-mode)
    :mode "\\.nix\\'")
#+end_src

**** lua
#+begin_src elisp
;;  (use-package lua-ts-mode
;;    :straight (:host sourcehut :repo "johnmuhl/lua-ts-mode")
;;    :mode "\\.lua\\'"
;;    :commands (lua-ts-mode))
#+end_src

** parenthesis and delimiters
*** rainbow delimiters
#+begin_src elisp
  (use-package rainbow-delimiters
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+end_src

*** highlight on hover
match the other pair of a delimiter on cursor hover
#+begin_src elisp
  (show-paren-mode)
  (setq show-paren-delay 0)
  (defun my-show-paren-any (orig-fun)
    (or (if (looking-at "\\s(") (funcall orig-fun))
	(if (looking-at "\\s)") (save-excursion (forward-char 1) (funcall orig-fun)))))
  (add-function :around show-paren-data-function #'my-show-paren-any)
#+end_src

*** jump to other pair
similar to vim % command
taken from [[https://www.emacswiki.org/emacs/NavigatingParentheses#h5o-2][emacs-wiki]]
#+begin_src elisp
  ;; since C-* is used also for smart-scan this function will fallback to oxcl/smartscan-wrap if the cursor
  ;; on a parenthesis
  (defun oxcl/goto-match-paren ()
    (interactive)
    (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
	  ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
	  (t (oxcl/smartscan-wrap))))
  (keymap-global-set "C-*" #'oxcl/goto-match-paren)
#+end_src

*** auto close opening delimiters
#+begin_src elisp
  (electric-pair-mode)
  (setq electric-pair-skip-whitespace nil)
#+end_src

** indentation
*** hungry delete
#+begin_src elisp
  (defun oxcl/hungry-delete ()
    (interactive)
    (let (( current-line (buffer-substring-no-properties
			  (line-beginning-position)
			  (line-end-position))))
      (if (and (string-blank-p current-line) (not (string-empty-p current-line)))
	  (progn
	    (open-line 1)
	    (beginning-of-line)
	    (kill-line))
	(delete-backward-char 1))))
  (defun oxcl/add-hungry-delete-bindings ()
    (local-set-key (kbd "S-DEL") (key-binding (kbd "DEL")))
    (local-set-key (kbd "DEL") #'oxcl/hungry-delete))
  (add-hook 'prog-mode-hook #'oxcl/add-hungry-delete-bindings)
  (add-hook 'text-mode-hook #'oxcl/add-hungry-delete-bindings)
#+end_src

** git
*** magit
#+begin_src elisp
;;  (use-package magit)
#+end_src

** snippets and templates
*** auto insert
automatically insert generic boilerplate via autoinsert and yasnippet when creating new files based on file extension
this code integrates yasnippet with the builtin yasnippet which is taken from  [[https://www.emacswiki.org/emacs/AutoInsertMod][emacs-wiki]]
#+begin_src elisp
  (defun oxcl/yas-insert ()
    "Replace text in yasnippet templates."
    (yas-expand-snippet (buffer-string) (point-min) (point-max)))

  (defun oxcl/setup-auto-insert ()
    (unless (featurep 'autoinsert)
      (require 'autoinsert)
      (auto-insert-mode)
      (setq auto-insert-query nil
            auto-insert-directory (expand-file-name "auto-inserts/" real-user-emacs-directory)
            auto-insert-alist '())
      ;; automatically load auto-insert snippets from .config/emacs/auto-inserts folder.
      ;; files which have only an underscore in the name will be applied to every file with that extension but only
      ;; if a more specific template is not found.
      (let ((auto-insert-files (cdr (cdr (directory-files (expand-file-name "auto-inserts" real-user-emacs-directory))))))
        (dolist (item auto-insert-files)
          (let ((pattern-name (if (equal (file-name-base item) "_")
                                  (if (file-name-extension item)
                                      (concat "\\." (file-name-extension item) "\\'")
                                    "\\'")
                                (if (file-name-extension item)
                                    (concat (file-name-base item) "\\." (file-name-extension item) "\\'")
                                  (concat (file-name-base item) "\\'")))))
                (add-to-list 'auto-insert-alist `(,pattern-name . [,item oxcl/yas-insert]) ))))))

#+end_src

*** yasnippet
#+begin_src elisp
    (use-package yasnippet
      :custom
      (yas-snippet-dirs `(,(expand-file-name "snippets" real-user-emacs-directory)))
      :config
      (yas-global-mode 1)
      (oxcl/setup-auto-insert))
#+end_src

** completion
*** defaults
#+begin_src elisp
  ;;  (setq-default completion-styles '(basic))
#+end_src

*** prescient
sorts the completion candidates based on recent usage and frequency.
makes the auto completion smarter by putting more common and more recent completion candidates first
**** base

#+begin_src elisp
  ;;	(use-package prescient
  ;;	  :defer t
  ;;	  :config
  ;;	  (prescient-persist-mode))
#+end_src

**** prescient for company-mode
#+begin_src elisp
  ;;  (use-package company-prescient
  ;;    :requires prescient
  ;;    :after company
  ;;    :hook (company-mode . company-prescient-mode))
#+end_src

** css
