home/.config/emacs/config.org
*** rainbow mode
colorize color codes like #ff0000 in the buffer.
it is automatically turned on for css,sass,scss and can be manually turned on with M-x rainbow-mode for other buffers
#+begin_src elisp
  (use-package rainbow-mode
    :hook (css-base-mode . rainbow-mode))
#+end_src

** hex editor
some enhancements to the builtin hex editor in emacs
*** detect binary files automatically
automatically detect binary format when opening files and switch to hex editor
#+begin_src elisp
  (add-hook 'find-file-hook (lambda ()
			      (when (equal buffer-file-coding-system 'no-conversion) (hexl-mode))))
  (add-to-list 'auto-mode-alist '("\\.\\(bin\\|exe\\|dat\\|dll\\|ana\\|anac\\|hex\\)\\'" . hexl-mode))
#+end_src

*** keybindings
add quality of life keybindings
#+begin_src elisp
  (defun oxcl/hexl-backspace ()
    (interactive)
    (hexl-backward-char 1)
    (hexl-insert-char 0 1)
    (hexl-backward-char 1))
  (add-hook 'hexl-mode-hook (lambda ()
			      (keymap-local-set "<backspace>" #'oxcl/hexl-backspace)))
#+end_src

*** mode-line info
TODO
display byte, short, float and integer representations of the value under the cursor in the mode-line
#+begin_src elisp
  (setq oxcl/hexl-val-in-byte ""
	oxcl/hexl-val-in-short ""
	oxcl/hexl-val-in-int32 ""
	oxcl/hexl-val-in-int64 ""
	oxcl/hexl-val-in-float ""
	oxcl/hexl-val-in-double "")
  (defun oxcl/hexl-update-mode-line ()
    ;;    (setq oxcl/hexl-val-in-byte (format "byte: %s" (char-after-point)))
    (force-mode-line-update) "string")
  (add-hook 'hexl-mode-hook
	    (lambda ()
	      (setq mode-line-format (append mode-line-format '((:eval oxcl/hexl-val-in-byte))))))
#+end_src

*** colorize hexl-mode
add colors to hexl-mode buffer
in my implementation of ~gruvbox-material~ i have defined custom faces:
- ~oxcl/hexl-printable-face~
- ~oxcl/hexl-null-face~
i will use these to colorize the hexl-mode buffer
#+begin_src elisp
  (setq oxcl/hexl-printable-left-regexp "$[2-7][a-zA-Z0-9]\\(?: \\)"
	oxcl/hexl-printable-right-regexp "\\(?:\\b\\)[2-7][a-zA-Z0-9]"
	oxcl/hexl-null-left-regexp  "00\\b"
	oxcl/hexl-null-right-regexp " 00"
	oxcl/hexl-ascii-regexp ".\\{1,16\\}$")
  (font-lock-add-keywords 'hexl-mode `((,oxcl/hexl-ascii-regexp           . 'oxcl/hexl-ascii-face)
				       (,oxcl/hexl-printable-left-regexp  . 'oxcl/hexl-printable-face)
				       (,oxcl/hexl-printable-right-regexp . 'oxcl/hexl-printable-face)
				       (,oxcl/hexl-null-left-regexp       . 'oxcl/hexl-null-face)
				       (,oxcl/hexl-null-right-regexp      . 'oxcl/hexl-null-face)) 'set)
#+end_src

** GNU poke
poke is an interactive and extensible editor for structured binary data with more advanced features than a simple hex editor
poke has a dedicated DSL named Poke which can be used to define binary structures.
poke integration with emacs comes in two packages: ~poke.el~ a user interface for poke and ~poke-mode~ a major mode for writing Poke files
*** poke.el
#+begin_src elisp
  (use-package poke
    :requires (poke-mode))
#+end_src

*** poke-mode
#+begin_src elisp
  (use-package poke-mode)
#+end_src

** editorconfig
#+begin_src elisp
  (use-package editorconfig
    :config
    (editorconfig-mode 1))
#+end_src


** terminal emulator
#+begin_src elisp
;;  (use-package vterm
;;    :custom
;;    (vterm-ignore-blink-cursor t)
;;    (vterm-environment '("_VTERM=1"))
;;    (vterm-clear-scrollback-when-clearing t)
;;    :config
;;    (add-hook 'vterm-mode-hook (lambda () )))
#+end_src

* rest client
** defaults
declare GET and POST requests in a http file and fire them up with emacs. similar to postman
#+begin_src elisp
    (use-package restclient
      :mode ("\\.http\\'" . restclient-mode)
      :commands restclient-mode
      :bind
      (:map restclient-mode-map
      ("C-c C-v" . restclient-http-send-current)
      ("C-c C-c" . restclient-http-send-current-stay-in-window)
      ("C-c C-d" . oxcl/restclient-send-current-show-headers))
      :config
      ;; fix yasnippet expand in restclient mode when fold/outline functionality is enabled
      (add-hook 'restclient-mode-hook (lambda () (local-set-key (kbd "<tab>") yas-maybe-expand)))
      ;; (remove-hook 'restclient-mode-hook 'restclient-outline-mode) ; disable fold in restclient-mode

      (setq restclient-inhibit-cookies t
	    restclient-response-body-only t
	    restclient-content-type-modes (append '(("application/json" . json-ts-mode)
						    ("application/octet-stream" . oxcl/restclient-hexl-mode))
						restclient-content-type-modes))
      (add-hook 'restclient-response-mode-hook (lambda () (jinx-mode -1) (yas-minor-mode -1))))
    (defun oxcl/restclient-send-current-show-headers ()
      (interactive)
      (setq restclient-response-body-only nil)
      (restclient-http-send-current-stay-in-window)
      (add-hook 'restclient-response-loaded-hook (lambda () (setq restclient-response-body-only t))))
#+end_src

** automatic http prefix injector
this function automatically adds a "http://" at the beginning of the url if it's missing one since httpclient.el doesn't add the http:// by default
#+begin_src elisp
  (defun oxcl/inject-http-to-url ()
  (interactive)
  (let ((line (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
    (when (and ;; if line begins with a http method but it doesn't include a http:// or https://
	 (string-match "^\\(GET\\|POST\\|PUT\\|PATCH\\|DELETE\\|HEAD\\|CONNECT\\|OPTIONS\\|TRACE\\) .*$" line)
	 (not (string-match "^\\w* \\(https:\\|http:\\)" line)))
      (save-excursion
	(beginning-of-line)
	(forward-word)
	(forward-char)
	(insert "http://"))))
  (newline))
  (add-hook 'restclient-mode-hook (lambda () (local-set-key (kbd "<return>") #'oxcl/inject-http-to-url)))
#+end_src

** org-mode babel integration
use ~#begin_src restclient~ to execute restclient requests inside an org-mode code block
#+begin_src elisp
  (use-package ob-restclient
    :after org-mode
    :config
    (org-babel-do-load-languages 'org-babel-load-languages ''((restclient . t))))
#+end_src

** jq integration
use jq to query and search the response object and store them in restclient variables with ~-> jq-set-var :<var-name> <jq-query>~
#+begin_src elisp
      (use-package jq-mode
	:hook (restclient-mode . (lambda () (require 'jq-mode))))
      (use-package restclient-jq :after jq-mode)
#+end_src
#+begin_src elisp
#+end_src

** json integration
prettify json files and diplay UTF-8 characters correctly
#+begin_src elisp
	(add-hook
	 'restclient-mode-hook
	 (lambda () (add-hook 'restclient-response-loaded-hook
			      (lambda () (when (eq major-mode 'json-ts-mode) (json-pretty-print-buffer))))))
#+end_src

** hexl-mode integration
automatically display responses with binary format in hexl-mode (emacs builtin hex editor)
#+begin_src elisp
  (defun oxcl/restclient-hexl-mode ()
    (set-buffer-file-coding-system 'binary)
    (setq buffer-undo-list nil)
    (hexl-mode))
  (add-hook 'restclient-mode-hook
	    (lambda()
	      (add-hook 'restclient-response-received-hook
			(lambda ()  (set-buffer-file-coding-system 'utf-8)
			  (when (eq major-mode 'hexl-mode) (hexl-mode-exit 0))))))

#+end_src

* dired
** sane defaults
#+begin_src elisp
  (setq delete-by-moving-to-trash t
	dired-listing-switches "-Ahl -v --group-directories-first"
	dired-dwim-target t
	dired-recursive-deletes t
	dired-kill-when-opening-new-dired-buffer t
	dired-create-destination-dirs t
	dired-auto-revert-buffer t)
  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
#+end_src

** keybindings
#+begin_src elisp
  ;; toggle a dired buffer in other window for current directory with C-x C-d
  ;;  (keymap-global-set "C-x C-d" #'dired-jump-other-window)
  (add-hook 'dired-mode-hook (lambda ()
			       (local-set-key (kbd "C-x C-d") #'quit-window)
			       ;; home key moves to the first item in list instead of the dired header
			       (local-set-key (kbd "<C-home>") (lambda ()
								 (beginning-of-buffer)
								 (next-line)))
			       ;; end key moves to the last item in list instead of the empty line
			       (local-set-key (kbd "<C-end>") (lambda ()
								(end-of-buffer)
								(previous-line)))
			       ;; replace '% m' with '%' and '% g' with '$'
			       (local-set-key (kbd "%") #'dired-mark-files-regexp)
			       (local-set-key (kbd "$") #'dired-mark-files-containing-regexp)))
#+end_src

** icons
#+begin_src elisp
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

* Other

;; (global-set-key (kbd "C-x C-z") 'repeat) ; C-x C-z is easier than C-x z

;; disable wrapping when in programming mode
(defun oxcl/truncate-lines-in-buffers () (setq truncate-lines t))
(add-hook 'prog-mode-hook 'oxcl/truncate-lines-in-buffers)
(add-hook 'conf-mode-hook 'oxcl/truncate-lines-in-buffers)

;; this function is useful when you have the alias zshrc in the shell to quickly edit zsh
;; config files with emacs
(defun zshrc ()
  (progn
    (delete-window)
    (find-file (expand-file-name "rc.zsh" (getenv "ZDOTDIR")))
    (split-window-below)
    (other-window 1)
    (find-file (expand-file-name "env.zsh" (getenv "ZDOTDIR")))
    (split-window-horizontally)
    (find-file (expand-file-name "alias.zsh" (getenv "ZDOTDIR")))
    (other-window -1)))

;; load package.el
(require 'package)
(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
			 ("nongnu"  . "https://elpa.nongnu.org/nongnu/")
			 ("melpa" . "https://melpa.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)



(use-package vterm)

(use-package easy-kill
  :config
;;  (global-set-key [remap kill-ring-save] 'easy-kill))

(use-package expand-region
  :config
;;  (global-set-key (kbd "C-=") 'er/expand-region))


(require 'move-lines)
(move-lines-binding)
* test
#+begin_src elisp
#+end_src

#+begin_src elisp
  (setq org-fold-core-style 'overlays)
       (use-package ctrlf
	 :config
	 (ctrlf-mode 1))
#+end_src
