home/.config/emacs/init.el

(use-package rainbow-mode
  :hook (css-base-mode . rainbow-mode))

(add-hook 'find-file-hook (lambda ()
			    (when (equal buffer-file-coding-system 'no-conversion) (hexl-mode))))
(add-to-list 'auto-mode-alist '("\\.\\(bin\\|exe\\|dat\\|dll\\|ana\\|anac\\|hex\\)\\'" . hexl-mode))

(defun oxcl/hexl-backspace ()
  (interactive)
  (hexl-backward-char 1)
  (hexl-insert-char 0 1)
  (hexl-backward-char 1))
(add-hook 'hexl-mode-hook (lambda ()
			    (keymap-local-set "<backspace>" #'oxcl/hexl-backspace)))

(setq oxcl/hexl-val-in-byte ""
      oxcl/hexl-val-in-short ""
      oxcl/hexl-val-in-int32 ""
      oxcl/hexl-val-in-int64 ""
      oxcl/hexl-val-in-float ""
      oxcl/hexl-val-in-double "")
(defun oxcl/hexl-update-mode-line ()
  ;;    (setq oxcl/hexl-val-in-byte (format "byte: %s" (char-after-point)))
  (force-mode-line-update) "string")
(add-hook 'hexl-mode-hook
	  (lambda ()
	    (setq mode-line-format (append mode-line-format '((:eval oxcl/hexl-val-in-byte))))))

(setq oxcl/hexl-printable-left-regexp "$[2-7][a-zA-Z0-9]\\(?: \\)"
      oxcl/hexl-printable-right-regexp "\\(?:\\b\\)[2-7][a-zA-Z0-9]"
      oxcl/hexl-null-left-regexp  "00\\b"
      oxcl/hexl-null-right-regexp " 00"
      oxcl/hexl-ascii-regexp ".\\{1,16\\}$")
(font-lock-add-keywords 'hexl-mode `((,oxcl/hexl-ascii-regexp           . 'oxcl/hexl-ascii-face)
				     (,oxcl/hexl-printable-left-regexp  . 'oxcl/hexl-printable-face)
				     (,oxcl/hexl-printable-right-regexp . 'oxcl/hexl-printable-face)
				     (,oxcl/hexl-null-left-regexp       . 'oxcl/hexl-null-face)
				     (,oxcl/hexl-null-right-regexp      . 'oxcl/hexl-null-face)) 'set)

(use-package poke
  :requires (poke-mode))

(use-package poke-mode)

(use-package editorconfig
  :config
  (editorconfig-mode 1))

;;  (use-package vterm
;;    :custom
;;    (vterm-ignore-blink-cursor t)
;;    (vterm-environment '("_VTERM=1"))
;;    (vterm-clear-scrollback-when-clearing t)
;;    :config
;;    (add-hook 'vterm-mode-hook (lambda () )))

(use-package restclient
  :mode ("\\.http\\'" . restclient-mode)
  :commands restclient-mode
  :bind 
  (:map restclient-mode-map
  ("C-c C-v" . restclient-http-send-current)
  ("C-c C-c" . restclient-http-send-current-stay-in-window)
  ("C-c C-d" . oxcl/restclient-send-current-show-headers))
  :config
  ;; fix yasnippet expand in restclient mode when fold/outline functionality is enabled
  (add-hook 'restclient-mode-hook (lambda () (local-set-key (kbd "<tab>") yas-maybe-expand)))
  ;; (remove-hook 'restclient-mode-hook 'restclient-outline-mode) ; disable fold in restclient-mode

  (setq restclient-inhibit-cookies t
	restclient-response-body-only t
	restclient-content-type-modes (append '(("application/json" . json-ts-mode)
						("application/octet-stream" . oxcl/restclient-hexl-mode))
					    restclient-content-type-modes))
  (add-hook 'restclient-response-mode-hook (lambda () (jinx-mode -1) (yas-minor-mode -1))))
(defun oxcl/restclient-send-current-show-headers ()
  (interactive)
  (setq restclient-response-body-only nil)
  (restclient-http-send-current-stay-in-window)
  (add-hook 'restclient-response-loaded-hook (lambda () (setq restclient-response-body-only t))))

(defun oxcl/inject-http-to-url ()
(interactive)
(let ((line (buffer-substring-no-properties (line-beginning-position) (line-end-position))))
  (when (and ;; if line begins with a http method but it doesn't include a http:// or https://
       (string-match "^\\(GET\\|POST\\|PUT\\|PATCH\\|DELETE\\|HEAD\\|CONNECT\\|OPTIONS\\|TRACE\\) .*$" line)
       (not (string-match "^\\w* \\(https:\\|http:\\)" line)))
    (save-excursion
      (beginning-of-line)
      (forward-word)
      (forward-char)
      (insert "http://"))))
(newline))
(add-hook 'restclient-mode-hook (lambda () (local-set-key (kbd "<return>") #'oxcl/inject-http-to-url)))

(use-package ob-restclient
  :after org-mode
  :config
  (org-babel-do-load-languages 'org-babel-load-languages ''((restclient . t))))

(use-package jq-mode
  :hook (restclient-mode . (lambda () (require 'jq-mode))))
(use-package restclient-jq :after jq-mode)



(add-hook
 'restclient-mode-hook
 (lambda () (add-hook 'restclient-response-loaded-hook
		      (lambda () (when (eq major-mode 'json-ts-mode) (json-pretty-print-buffer))))))

(defun oxcl/restclient-hexl-mode ()
  (set-buffer-file-coding-system 'binary)
  (setq buffer-undo-list nil)
  (hexl-mode))
(add-hook 'restclient-mode-hook
	  (lambda() 
	    (add-hook 'restclient-response-received-hook
		      (lambda ()  (set-buffer-file-coding-system 'utf-8)
			(when (eq major-mode 'hexl-mode) (hexl-mode-exit 0))))))

(setq delete-by-moving-to-trash t
      dired-listing-switches "-Ahl -v --group-directories-first"
      dired-dwim-target t
      dired-recursive-deletes t
      dired-kill-when-opening-new-dired-buffer t
      dired-create-destination-dirs t
      dired-auto-revert-buffer t)
(add-hook 'dired-mode-hook #'dired-hide-details-mode)

;; toggle a dired buffer in other window for current directory with C-x C-d
;;  (keymap-global-set "C-x C-d" #'dired-jump-other-window)
(add-hook 'dired-mode-hook (lambda () 
			     (local-set-key (kbd "C-x C-d") #'quit-window)
			     ;; home key moves to the first item in list instead of the dired header
			     (local-set-key (kbd "<C-home>") (lambda ()
							       (beginning-of-buffer)
							       (next-line)))
			     ;; end key moves to the last item in list instead of the empty line
			     (local-set-key (kbd "<C-end>") (lambda ()
							      (end-of-buffer)
							      (previous-line)))
			     ;; replace '% m' with '%' and '% g' with '$'
			     (local-set-key (kbd "%") #'dired-mark-files-regexp)
			     (local-set-key (kbd "$") #'dired-mark-files-containing-regexp)))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(setq org-fold-core-style 'overlays)

(use-package ctrlf
  :config
  (ctrlf-mode 1))
